/* ************************************************************************

							綜合程序-CPU读取  主程序

***************************************************************************
 名称：綜合程序-CPU读取  主程序
 时间：2014.04.30
 内容：本程序包括：
       CPU卡读写、PSAM卡读写、M1卡读写
 说明：M1卡/CPU卡操作流程优化，对操作流程进行封装(其中卡类型、语音提示根据UID自定义)
	   綜合程序优化，主要是简化 2014 04-30 12:00
*************************************************************************** */
#include "system.h"
#include "uart.h"
#include "card.h"
#include "function.h"
//-----------------------------------------------------
//main()主函數
//-----------------------------------------------------
void main()
{   
	unsigned char i;
	Init_Device();
	//---------------------------------------------------------------------
	while ( 1 )
	{
		DS1302_PLAY_TIME();   					//1302时间显示

		CARD_CONNECT_Enable();					//连接卡片
		Uart1_Judge_received();	
		//-------------------------------------------------
		if(buffer[3] == 0xC0)					//连卡正确，则存储UID
		{
			for (i = 0;i<4;i++)                	//存储4Hex的UID
			{
				CARD_UID_buffer[i] = buffer[i+9];
			}
		}
		//-------------M1卡消费流程--------------------------
		M1_Operation_Process();					//M1卡消费流程
		
		//------------CPU卡消费流程--------------------------
		CPU_Operation_Process();				//CPU卡消费流程
	} //while(1);
    //----------------------------------------------------------------------
}//main();
